---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AssetPropertyList
source: html/a891f5eb-302b-0ca7-ed29-99e3591b407e.htm
---
# AssetPropertyList Properties

Identifies if the object is read-only or modifiable.
 If true, the object may not be modified. If false, the object's contents may be modified.